[{
	"title": "Organization Strategic Plan and Project Calendar, Program and Project Portfolio",
	"url": "https://www.schneier.com/blog/archives/2023/02/attacking-machine-learning-systems.html",
	"body": "An organization strategic plan is a document that defines the vision, mission, goals, and objectives of the organization for a specific period of time. It also outlines the strategies and actions that will be implemented to achieve those goals and objectives. The strategic plan serves as a guide for the organization\\u2019s decision-making, resource allocation, and performance measurement. A project calendar is a tool that helps to plan, schedule, and track the activities and milestones of a project.It shows the start and end dates, durations, dependencies, and resources of each task in the project.A project calendar helps to coordinate the work of the project team, communicate the expectations and progress to the stakeholders, and identify and resolve any potential issues or risks.  A program is a group of related projects and change management activities that will deliver beneficial change for the organization.A program is managed as a whole to achieve outcomes that are aligned with the organization\\u2019 s strategic plan.A program manager is responsible for overseeing the planning, coordination, control, and delivery of the projects and change activities within the program.A program manager also manages the interdependencies, risks, issues, benefits, and stakeholders of the program.  A project portfolio is a collection of projects and programs that are grouped together based on some criteria, such as geographical location, capability, customer type, or strategic alignment.A project portfolio is designed to maximize the return on investment, balance the risks and opportunities, maintain the skills and capabilities of the workforce, and support the organization\\u2019 s strategic plan.A project portfolio manager is responsible for selecting, prioritizing, and monitoring the projects and programs within the portfolio.A project portfolio manager also ensures that the portfolio is aligned with the organization\\u2019 s strategy and objectives, provides the necessary resources and support for the projects and programs, and evaluates their performance and benefits.  The relationship between organization strategic plan, project calendar, program, and project portfolio can be summarized as follows:   The organization strategic plan provides the direction and guidance for the organization\\u2019 s activities and initiatives. The project calendar helps to plan and execute the individual projects that contribute to the organization\\u2019 s goals and objectives. The program integrates and manages multiple related projects and change activities that deliver outcomes that support the organization\\u2019 s strategic plan. The project portfolio aligns and optimizes a set of projects and programs that maximize the value and benefits for the organization."
}]