[{
  "title":"Project manager CV",
  "url":"made up",
  "body": "Experience **Project Manager | ABC Company | Jan 2020 - Present** Managed several small projects or sub-projects for various clients in different sectors.\nApplied agile project management methods and tools to deliver high-quality products on time and within budget.\nIdentified, assessed, and managed risks effectively using risk registers and mitigation strategies.\nPrepared realistic project plans (including scope, schedule, quality, risk, and communication plans) and tracked activities against the project schedule using Gantt charts and other tools.\nMonitored costs, times, quality, and resources used and took action where these exceeded agreed tolerances using dashboards and reports.\nManaged stakeholder involvement as appropriate using communication plans, meetings, and feedback sessions. Project Coordinator | XYZ Company | Jun 2018 - Dec 2019 Coordinated the activities of small project teams for various internal and external projects.\nSupported the senior project manager in applying appropriate project management methods and tools.\nAssisted in identifying, assessing, and managing risks effectively using risk registers and mitigation strategies.\nHelped in preparing realistic project plans (including scope, schedule, quality, risk, and communication plans) and tracked activities against the project schedule using Gantt charts and other tools.\nReported on costs, times, quality, and resources used and alerted the project manager where these exceeded agreed tolerances using dashboards and reports.\nFacilitated stakeholder involvement as appropriate using communication plans, meetings, and feedback sessions. Education **Master of Science in Project Management | the University of Madrid | Sep 2016 - Jun 2018** Graduated with honors\nCompleted a thesis on risk management in agile projects\n**Bachelor of Science in Business Administration | University of Madrid | Sep 2014 - Jun 2016** Graduated with honors\nMajored in management References Available upon request."
}]
