[
    { "title": "System Operator Test Paragraph",
        "url": "https://sebokwiki.org/wiki/System_Operator_Test_Paragraph",
        "body":"The role of systems engineering (SE) during the operation of a system consists of ensuring that the system maintains key mission and business functions and is operationally effective. The systems engineer is one of the stakeholders who ensures that maintenance actions and other major changes are performed according to the long-term vision of the system. Both the maintenance actions and any implemented changes must meet the evolving needs of owning and operating stakeholders consistent with the documented and approved architecture. SE considerations will also include the eventual decommissioning or disposal of the system so that the disposal occurs according to disposal/retirement plans. Those plans must account for and be compliant with relevant laws and regulations (for additional information on disposal or retirement, please see the Product and Service Life Management knowledge area (KA)). When the system-of-interest (SoI) replaces an existing or legacy system, it may be necessary to manage the migration between systems such that stakeholders do not experience a breakdown in services (INCOSE 2012)"
    },
    {
    "title": "System Operation",
    "url": "https://sebokwiki.org/wiki/System_Operation",
    "body": "<div id=\"content\" class=\"mw-body\" role=\"main\">\n\t<a id=\"top\"></a>\n\t<div id=\"siteNotice\" class=\"mw-body-content\"></div>\n\t<div class=\"mw-indicators mw-body-content\">\n\t<div id=\"mw-indicator-smw-entity-examiner\" class=\"mw-indicator\"></div>\n\t</div>\n\t<h1 id=\"firstHeading\" class=\"firstHeading\" lang=\"en\">System Operation</h1>\n\t<div id=\"bodyContent\" class=\"mw-body-content\">\n\t\t<div id=\"siteSub\" class=\"noprint\">From SEBoK</div>\n\t\t<div id=\"contentSub\"><div id=\"breadcrumbs\"> <a href=\"/wiki/System_Operation\" class=\"cat-part_3 cat-system_deployment_and_use cat-topic\" title=\"System Operation\">System Operation</a></div></div>\n\t\t<div id=\"contentSub2\"></div>\n\t\t\n\t\t<div id=\"jump-to-nav\"></div>\n\t\t<a class=\"mw-jump-link\" href=\"#mw-head\">Jump to navigation</a>\n\t\t<a class=\"mw-jump-link\" href=\"#searchInput\">Jump to search</a>\n\t\t<div id=\"mw-content-text\" lang=\"en\" dir=\"ltr\" class=\"mw-content-ltr\"><div class=\"mw-parser-output\"><hr>\n<p><i><b>Lead Authors:</b></i> <i>Scott Jackson, Brian Gallagher</i>, <i><b>Contributing Author:</b></i> <i>Leopoldo deCardenas</i>\n</p>\n<hr>\n<p>The role of <span class=\"noprint\"><a href=\"/wiki/Systems_Engineering_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Systems Engineering (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p>The definition of systems engineering has evolved over time. The current accepted definitions are found below:&amp;lt;blockquote&amp;gt;<i>(1) Interdisciplinary approach governing the total technical and managerial effort required to transform a set of customer needs, expectations, and constraints into a solution and to support that solution throughout its life.</i> (ISO/IEC/IEEE 2010) &amp;lt;/blockquote&amp;gt;&amp;lt;blockquote&amp;gt;<i>(2) An interdisciplinary approach and means to enable the realization of successful systems. It focuses on defining customer needs and required functionality early in the development cycle, documenting requirements, then proceeding with design synthesis and system validation while considering the complete problem: </i>\n</p>\n<ul><li><i>Operations</i></li>\n<li><i>Performance</i></li>\n<li><i>Test</i></li>\n<li><i>Manufacturing</i></li>\n<li><i>Cost &amp;amp; Schedule</i></li>\n<li><i>Training &amp;amp; Support</i></li>\n<li><i>Disposal</i></li></ul>\n<p><i>Systems engineering integrates all the disciplines and specialty groups into a team effort forming a structured development process that proceeds from concept to production to operation. Systems engineering considers both the business and the technical needs of all customers with the goal of providing a quality product that meets the user needs.</i>  (INCOSE 2012)\n</p><p><i>(3) A transdisiplinary and integrative approach to enable the successful realization, use, and retirement of engineered systems, using systems principles and concepts, and scientific, technological, and management methods.</i> \n</p><p>We use the terms “engineering” and “engineered” in their widest sense: “the action of working artfully to bring something about”. “Engineered systems” may be composed of any or all of people, products, services, information, processes, and natural elements. (INCOSE Fellows 2019) &amp;lt;/blockquote&amp;gt;\n</p>\">systems engineering</span></a></span><span class=\"printonly\">systems engineering</span> (SE) during the operation of a system consists of ensuring that the system maintains key mission and business functions and is operationally effective. The systems engineer is one of the <span class=\"noprint\"><a href=\"/wiki/Stakeholder_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Stakeholder (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p>&amp;lt;blockquote&amp;gt;(1) <i>Individual or organization having a right, share, claim, or interest in a system or in its possession of</i>\ncharacteristics that meet their needs and expectations<i> (ISO/IEC/IEEE 2015) </i>&amp;lt;/blockquote&amp;gt;\n</p><p>&amp;lt;blockquote&amp;gt;(2) <i>Individual or organization having a right, share, claim, or interest in a system or in its possession of characteristics that meet their needs and expectations;  N.B. Stakeholders include, but are not limited to end users, end user organizations, supporters, developers, producers, trainers, maintainers, disposers, acquirers, customers, operators, supplier organizations and regulatory bodies.</i>  (ISO/IEC June 2010) &amp;lt;/blockquote&amp;gt;\n</p><p>&amp;lt;blockquote&amp;gt;(3) <i>An individual, team, or organization (or classes thereof) with interests in, or concerns relative to, a system.</i>  (ISO/IEC 2007)&amp;lt;/blockquote&amp;gt;\n</p><p>&amp;lt;blockquote&amp;gt;(4) <i>A stakeholder in an organisation is (by definition) any group or individual who can affect or is affected by the achievement of the organisation's objectives.</i> (Freeman 1984)&amp;lt;/blockquote&amp;gt;\n</p>\">stakeholders</span></a></span><span class=\"printonly\">stakeholders</span> who ensures that maintenance actions and other major changes are performed according to the long-term vision of the system. Both the maintenance actions and any implemented changes must meet the evolving needs of owning and operating stakeholders consistent with the documented and approved architecture. SE considerations will also include the eventual decommissioning or disposal of the system so that the disposal occurs according to disposal/retirement plans. Those plans must account for and be compliant with relevant laws and regulations (for additional information on disposal or retirement, please see the <a href=\"/wiki/Product_and_Service_Life_Management\" class=\"mw-redirect\" title=\"Product and Service Life Management\">Product and Service Life Management</a> knowledge area (KA)). When the <span class=\"noprint\"><a href=\"/wiki/System-of-Interest_(glossary)\" class=\"cat-glossary_of_terms\" title=\"System-of-Interest (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p>&amp;lt;blockquote&amp;gt;<i>(1) The system whose life cycle is under consideration.</i> (ISO/IEC/IEEE 2015) &amp;lt;/blockquote&amp;gt;\n</p><p>&amp;lt;blockquote&amp;gt;<i>(2) The system of interest to an observer.</i> (Bertalanffy 1968)&amp;lt;/blockquote&amp;gt;\n</p>\">system-of-interest</span></a></span><span class=\"printonly\">system-of-interest</span> (SoI) replaces an existing or legacy system, it may be necessary to manage the migration between systems such that stakeholders do not experience a breakdown in services (INCOSE 2012).  \n</p>\n<div id=\"toc\" class=\"toc\" role=\"navigation\" aria-labelledby=\"mw-toc-heading\"><input type=\"checkbox\" role=\"button\" id=\"toctogglecheckbox\" class=\"toctogglecheckbox\" style=\"display:none\"><div class=\"toctitle\" lang=\"en\" dir=\"ltr\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Definition_.26_Purpose\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Definition &amp; Purpose</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#Process_Approaches\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Process Approaches</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-3\"><a href=\"#Applicable_Methods_.26_Tools\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Applicable Methods &amp; Tools</span></a>\n<ul>\n<li class=\"toclevel-3 tocsection-4\"><a href=\"#Training_and_Certification\"><span class=\"tocnumber\">2.1.1</span> <span class=\"toctext\">Training and Certification</span></a></li>\n</ul>\n</li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-5\"><a href=\"#Practical_Considerations\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Practical Considerations</span></a></li>\n<li class=\"toclevel-1 tocsection-6\"><a href=\"#References\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">References</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-7\"><a href=\"#Works_Cited\"><span class=\"tocnumber\">4.1</span> <span class=\"toctext\">Works Cited</span></a></li>\n<li class=\"toclevel-2 tocsection-8\"><a href=\"#Primary_References\"><span class=\"tocnumber\">4.2</span> <span class=\"toctext\">Primary References</span></a></li>\n<li class=\"toclevel-2 tocsection-9\"><a href=\"#Additional_References\"><span class=\"tocnumber\">4.3</span> <span class=\"toctext\">Additional References</span></a></li>\n</ul>\n</li>\n</ul>\n</div>\n\n<h2><span id=\"Definition_&amp;_Purpose\"></span><span class=\"mw-headline\" id=\"Definition_.26_Purpose\">Definition &amp; Purpose</span></h2>\n<p>This process assigns personnel to operate the system and monitors the services and operator-system performance. In order to sustain services, it identifies and analyzes operational problems in relation to agreements, stakeholder requirements, and organizational constraints (ISO/IEC/IEEE 2015). \n</p><p>The <span class=\"noprint\"><a href=\"/wiki/Concept_of_Operations_(ConOps)_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Concept of Operations (ConOps) (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p><i>&amp;lt;blockquote&amp;gt;Verbal and graphic statement, in broad outline, of an organization’s assumptions or intent in regard to an operation or series of operations.</i> (ISO/IEC 2011)&amp;lt;/blockquote&amp;gt;\n</p>\">concept of operations</span></a></span><span class=\"printonly\">concept of operations</span> (ConOps) establishes the foundation for initial design specifications according to the long-term vision. It is also possible that pre-planned program improvements (P3I) had been generated based on expected evolving requirements. Throughout the <span class=\"noprint\"><a href=\"/wiki/Life_Cycle_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Life Cycle (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p>&amp;lt;blockquote&amp;gt;<i>(1) The organized collection of activities, relationships and contracts which apply to a system-of-interest during its life.</i> (Pyster 2009, 73)&amp;lt;/blockquote&amp;gt;\n</p><p>&amp;lt;blockquote&amp;gt;<i>(2) The evolution of a system, product, service, project or other human-made entity from conception through retirement.</i> (ISO/IEC/IEEE 2015)&amp;lt;/blockquote&amp;gt;\n</p><p>&amp;lt;blockquote&amp;gt;<i>(3) Development (life) cycles start with user needs and end with system decommissioning and disposal. Project cycles contain three aspects: business, budget, and technical.</i> (Mooz, Forsberg, Cotterman 2003, 259)&amp;lt;/blockquote&amp;gt;\n</p>\">systems life cycle</span></a></span><span class=\"printonly\">systems life cycle</span>, the operation of the system requires the systems engineer to be an active participant in reviews, change management and integrated master schedule activities to ensure the system operations continue to meet the evolving needs of stakeholders, and are consistent with the architecture through the eventual decommissioning or disposal of the system. In the event of decommissioning, a systems engineer must ensure disposal/retirement plans are compliant with relevant laws and regulations (for additional information on disposal or retirement, see the <a href=\"/wiki/Product_and_Service_Life_Management\" class=\"mw-redirect\" title=\"Product and Service Life Management\">Product and Service Life Management</a> KA).  \n</p><p>Two additional areas are of interest to the systems engineer during system operation require special attention. First, it may be determined that a system is at the end of its life cycle, but the cost of replacing the system with a completely new design is too expensive. In this case, there will be intense engineering activities for service life extension program (SLEP). The SLEP solution will take into account obsolescence issues, diminishing manufacturing sources and material shortages (DMSMS), and changes in ConOps.  Secondly, in the event that a new SoI is designed and produced as a complete replacement for an existing or legacy system, it will be necessary to manage the migration between systems such that stakeholders do not experience a breakdown in services (INCOSE 2012).\n</p>\n<h2><span class=\"mw-headline\" id=\"Process_Approaches\">Process Approaches</span></h2>\n<p>During the operational phase, SE activities ensure the system maintains certain operational attributes and usefulness throughout its expected life span. Maintaining operational effectiveness consists of evaluating certain operationally relevant attributes and trends, taking actions to prevent degradation of performance, evolving the system to meet changing mission or business needs (see the <a href=\"/wiki/Product_and_Service_Life_Management\" class=\"mw-redirect\" title=\"Product and Service Life Management\">Product and Service Life Management</a> KA), and eventually decommissioning the system and disposing of its components. During operation, data would be collected to evaluate the system and determine if changes should be made. It is important to include the process for data collection during operations when considering design and ConOps. In some cases, data may be collected by sensors and reported autonomously. In other cases, operators will identify and report on performance during operations. The systems engineer needs to understand how all data will be collected and presented for further analysis. The systems engineer will be involved in analysis of this data in several areas, including the following: \n</p>\n<ul><li>Updating training and development of new training as required for operational and support personnel. Training is generally developed early with system design and production and executed during integration and operations. Determination of training updates or changes will be based on evaluation of the operational and support personnel.</li>\n<li>Evaluation of operational effectiveness. Early in the planning phases of a new system or capability, measures of operational effectiveness are established based on mission and business goals. These measures are important during system operation. These attributes are unique for each system and represent characteristics describing the usefulness of the system as defined and agreed to by system stakeholders. Systems engineers monitor and analyze these measurements and recommend actions.</li>\n<li>Failure reporting and corrective actions (FRACA) activities will involve the collection and analysis of data during operations. FRACA data will provide trends involving failures that may require design or component changes.  Some failures may also result in safety issues requiring operational modifications until the offending elements under analysis can be corrected. If components or systems must be returned to maintenance facilities for corrective repairs, there will be operational and business impacts due to increased unavailability and unplanned transportation cost.</li></ul>\n<h3><span id=\"Applicable_Methods_&amp;_Tools\"></span><span class=\"mw-headline\" id=\"Applicable_Methods_.26_Tools\">Applicable Methods &amp; Tools</span></h3>\n<p>Operations manuals generally provide operators the steps and activities required to run the system.\n</p>\n<h4><span class=\"mw-headline\" id=\"Training_and_Certification\">Training and Certification</span></h4>\n<p>Adequate training must be provided for the operators who are required to operate the system. There are many objectives of training:\n</p>\n<ul><li>Provide initial training for all operators in order to equip them with the skill and knowledge to operate the system. Ideally, this process will begin prior to system transition and will facilitate delivery of the system. It is important to define the certification standards and required training materials up front (for more information on material supply, please see <a href=\"/wiki/Logistics\" class=\"cat-part_3 cat-system_deployment_and_use cat-topic\" title=\"Logistics\">Logistics</a>).</li>\n<li>Provide continuation training to ensure currency of knowledge.</li>\n<li>Monitor the qualification/certification of the operators to ensure that all personnel operating the system meet the minimum skill requirements and that their currency remains valid.</li>\n<li>Monitor and evaluate the job performance to determine the adequacy of the training program.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Practical_Considerations\">Practical Considerations</span></h2>\n<p>The operation process sustains system services by assigning trained personnel to operate the system, as well as by monitoring operator-system performance and monitoring the system performance. In order to sustain services, the operation process identifies and analyzes operational problems in relation to <span class=\"noprint\"><a href=\"/wiki/Agreement_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Agreement (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p>&amp;lt;blockquote&amp;gt;<i>Mutual acknowledgment of terms and conditions under which a working relationship is conducted.</i> (ISO/IEEE 2008, 1, Section 4.4)&amp;lt;/blockquote&amp;gt;\n</p>\">agreements</span></a></span><span class=\"printonly\">agreements</span>, <span class=\"noprint\"><a href=\"/wiki/Stakeholder_Requirement_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Stakeholder Requirement (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p><i>\u007f'&amp;quot;`UNIQ--nowiki-00000006-QINU`&amp;quot;'\u007f</i>&amp;lt;blockquote&amp;gt;<i>(1a) The requirements for a system that can provide the services needed by users and other stakeholders in a defined environment.</i> (ISO/IEC/IEEE, 2015, section 6.4.1)&amp;lt;/blockquote&amp;gt;\n</p><p><i>\u007f'&amp;quot;`UNIQ--nowiki-00000007-QINU`&amp;quot;'\u007f</i>&amp;lt;blockquote&amp;gt;<i>(1b) The stakeholder needs and requirements definition process identifies stakeholders, or stakeholder classes, involved with the system throughout its life cycle, and their needs. It analyzes and transforms these needs into a common set of stakeholder requirements that express the intended interaction the system will have with its operational environment and that are the reference against which each resulting operational capability is validated. The stakeholder requirements are defined considering the context of the system-of-interest with the interoperating systems and enabling systems. (ISO/IEC/IEEE,2015) &amp;lt;/blockquote&amp;gt;</i>\n</p>\">stakeholder requirements</span></a></span><span class=\"printonly\">stakeholder requirements</span>, and organizational <span class=\"noprint\"><a href=\"/wiki/Constraint_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Constraint (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p>&amp;lt;blockquote&amp;gt;<i>(1) A restriction, limit, or regulation imposed on a product, project, or process.</i> (ANSI/EIA 1998)&amp;lt;/blockquote&amp;gt;\n</p><p>&amp;lt;blockquote&amp;gt;<i>(2) A type of requirement or design feature that cannot be traded off.</i> (ANSI/EIA 1998)&amp;lt;/blockquote&amp;gt;\n</p>\">constraints</span></a></span><span class=\"printonly\">constraints</span>. When the system replaces an existing system, it may be necessary to manage the migration between systems such that persistent stakeholders do not experience a breakdown in services.\n</p><p>Results of a successful implementation of the operation process include:\n</p>\n<ul><li>Definition and refinement of an operation strategy along the way</li>\n<li>Delivery of services that meet stakeholder requirements</li>\n<li>Satisfactory completion of approved, corrective action requests</li>\n<li>Continued stakeholder satisfaction</li></ul>\n<p>Outputs of the operation process include:\n</p>\n<ul><li>Operational strategy, including staffing and sustainment of enabling systems and materials</li>\n<li>System performance reports (statistics, usage data, and operational cost data)</li>\n<li>System trouble/anomaly reports with recommendations for appropriate action</li>\n<li>Operational availability constraints to influence future design and specification of similar systems or reused system elements</li></ul>\n<p>Activities of the operation process include:\n</p>\n<ul><li>Providing operator training to sustain a pool of operators</li>\n<li>Tracking system performance and accounting for operational availability</li>\n<li>Performing operational analysis</li>\n<li>Managing operational support logistics</li>\n<li>Documenting system status and actions taken</li>\n<li>Reporting malfunctions and recommendations for improvement</li></ul>\n<h2><span class=\"mw-headline\" id=\"References\">References</span></h2>\n<h3><span class=\"mw-headline\" id=\"Works_Cited\">Works Cited</span></h3>\n<p>INCOSE. 2012. <i><a href=\"/wiki/INCOSE_Systems_Engineering_Handbook\" class=\"cat-primary_reference\" title=\"INCOSE Systems Engineering Handbook\">INCOSE Systems Engineering Handbook</a>: A Guide for System Life Cycle Processes and Activities,</i> version 3.2.2. San Diego, CA, USA: International Council on Systems Engineering (INCOSE), INCOSE-TP-2003-002-03.2.2.\n</p><p>ISO/IEC/IEEE. 2015. <i><a href=\"/wiki/ISO/IEC/IEEE_15288\" class=\"cat-primary_reference\" title=\"ISO/IEC/IEEE 15288\">Systems and Software Engineering -- System Life Cycle Processes</a></i>. Geneva, Switzerland: International Organisation for Standardisation (ISO)/International Electrotechnical Commissions (IEC)/Institute of Electrical and Electronics Engineers (IEEE). ISO/IEC/IEEE 15288:2015.\n</p>\n<h3><span class=\"mw-headline\" id=\"Primary_References\">Primary References</span></h3>\n<p>Blanchard, B.S. and W.J. Fabrycky. 2011. <i><a href=\"/wiki/Systems_Engineering_and_Analysis\" class=\"cat-primary_reference\" title=\"Systems Engineering and Analysis\">Systems Engineering and Analysis</a>,</i> 5th Edition. Englewood Cliffs, NJ, USA: Prentice Hall. \n</p><p>Institute of Engineers Singapore. 2009. <i><a href=\"/wiki/Systems_Engineering_Body_of_Knowledge_(Singapore)\" class=\"cat-primary_reference\" title=\"Systems Engineering Body of Knowledge (Singapore)\">Systems Engineering Body of Knowledge</a></i>. Provisional version 2.0. Singapore: Institute of Engineers Singapore. \n</p><p>INCOSE. 2012. <i><a href=\"/wiki/INCOSE_Systems_Engineering_Handbook\" class=\"cat-primary_reference\" title=\"INCOSE Systems Engineering Handbook\">INCOSE Systems Engineering Handbook</a>: A Guide for System Life Cycle Processes and Activities,</i> version 3.2.2. San Diego, CA, USA: International Council on Systems Engineering (INCOSE), INCOSE-TP-2003-002-03.2.2.\n</p><p>ISO/IEC/IEEE. 2015. <i><a href=\"/wiki/ISO/IEC/IEEE_15288\" class=\"cat-primary_reference\" title=\"ISO/IEC/IEEE 15288\">Systems and Software Engineering -- System Life Cycle Processes</a></i>. Geneva, Switzerland: International Organisation for Standardisation (ISO)/International Electrotechnical Commissions (IEC)/Institute of Electrical and Electronics Engineers (IEEE). ISO/IEC/IEEE 15288:2015.\n</p>\n<h3><span class=\"mw-headline\" id=\"Additional_References\">Additional References</span></h3>\n<p>None.\n</p>\n<hr>\n<center><a href=\"/wiki/System_Validation\" class=\"cat-part_3 cat-system_realization cat-topic\" title=\"System Validation\">&lt; Previous Article</a>  |  <a href=\"/wiki/Systems_Engineering_and_Management\" class=\"cat-part cat-part_3\" title=\"Systems Engineering and Management\">Parent Article</a>  |  <a href=\"/wiki/System_Maintenance\" class=\"cat-part_3 cat-system_deployment_and_use cat-topic\" title=\"System Maintenance\">Next Article &gt;</a></center>\n<center><b>SEBoK v. 2.8, released 31 May 2023</b></center>\n<!-- \nNewPP limit report\nCached time: 20230810225858\nCache expiry: 86400\nDynamic content: false\nComplications: []\n[SMW] In‐text annotation parser time: 0 seconds\nCPU time usage: 0.054 seconds\nReal time usage: 0.065 seconds\nPreprocessor visited node count: 273/1000000\nPost‐expand include size: 7990/2097152 bytes\nTemplate argument size: 968/2097152 bytes\nHighest expansion depth: 7/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 7330/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   30.096      1 -total\n 97.99%   29.490      8 Template:Term\n-->\n\n<!-- Saved in parser cache with key sebok_prod_new-bkcase_:pcache:idhash:128-0!canonical and timestamp 20230810225857 and revision id 67969\n -->\n</div></div><div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"https://sebokwiki.org/w/index.php?title=System_Operation&amp;oldid=67969\">https://sebokwiki.org/w/index.php?title=System_Operation&amp;oldid=67969</a>\"</div>\n\t\t<div id=\"catlinks\" class=\"catlinks\" data-mw=\"interface\"><div id=\"mw-normal-catlinks\" class=\"mw-normal-catlinks\"><a href=\"/wiki/Special:Categories\" title=\"Special:Categories\">Categories</a>: <ul><li><a href=\"/wiki/Category:Part_3\" class=\"cat-part\" title=\"Category:Part 3\">Part 3</a></li><li><a href=\"/wiki/Category:Topic\" title=\"Category:Topic\">Topic</a></li><li><a href=\"/wiki/Category:System_Deployment_and_Use\" title=\"Category:System Deployment and Use\">System Deployment and Use</a></li></ul></div></div><div class=\"cs-comments\" id=\"cs-comments\"><div class=\"cs-header\" id=\"cs-header\"><button type=\"button\" class=\"cs-add-button cs-button\" title=\"Add comment\" data-toggle=\"tooltip\" id=\"cs-add-button\"><img title=\"add comment\" src=\"/w/extensions/CommentStreams/images/comment_add.png\"><span class=\"cs-comment-button-label\">Add comment</span></button></div><div class=\"cs-footer\" id=\"cs-footer\"></div></div>\n\t</div>\n</div>"},

{
    "title": "Maintainability (glossary)",
    "url": "https://sebokwiki.org/wiki/Maintainability_(glossary)",
    "body":"<div id=\"bodyContent\" class=\"mw-body-content\">\n    <div id=\"siteSub\" class=\"noprint\">From SEBoK</div>\n    <div id=\"contentSub\"><div id=\"breadcrumbs\"> <a href=\"/wiki/System_Operation\" class=\"cat-part_3 cat-system_deployment_and_use cat-topic\" title=\"System Operation\">System Operation</a> &gt; <a href=\"/wiki/Procurement_and_Acquisition\" class=\"cat-part_6 cat-systems_engineering_and_project_management cat-topic\" title=\"Procurement and Acquisition\">Procurement and Acquisition</a> &gt; <a href=\"/wiki/System_Maintenance\" class=\"cat-part_3 cat-system_deployment_and_use cat-topic\" title=\"System Maintenance\">System Maintenance</a> &gt; <a href=\"/wiki/Maintainability_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Maintainability (glossary)\">maintainability </a></div></div>\n    <div id=\"contentSub2\"></div>\n    \n    <div id=\"jump-to-nav\"></div>\n    <a class=\"mw-jump-link\" href=\"#mw-head\">Jump to navigation</a>\n    <a class=\"mw-jump-link\" href=\"#searchInput\">Jump to search</a>\n    <div id=\"mw-content-text\" lang=\"en\" dir=\"ltr\" class=\"mw-content-ltr\"><div class=\"mw-parser-output\"><blockquote><p>(1) <i>Maintainability is defined as the probability that a system or system element can be repaired in a defined environment with defined resources within a specified period of time. Increased maintainability implies shorter repair times.</i> (Created for SEBoK)</p></blockquote>\n<blockquote><p>(2) <i>The American Society for Quality uses this definition.  \"Maintainability: The probability that a given maintenance action for an item under given usage conditions can be performed within a stated time interval when the maintenance is performed under stated conditions using stated procedures and resources.\"</i> (ASQ 2011) The definition above simplifies the ASQ definition.<i></i></p></blockquote>\n<h3><span class=\"mw-headline\" id=\"Sources\">Sources</span></h3>\n<p>(1) This definition was developed for the SEBoK.\n</p><p>(2) American Society for Quality. 2011. \"Glossary: Maintainability.\" Accessed on 11 September 2012. Available at <a rel=\"nofollow\" class=\"external free\" href=\"http://asq.org/glossary/m.html\">http://asq.org/glossary/m.html</a>.\n</p>\n<h3><span class=\"mw-headline\" id=\"Discussion\">Discussion</span></h3>\n<p>None.\n</p>\n<center><b>SEBoK v. 2.8, released 31 May 2023</b></center>\n<!-- \nNewPP limit report\nCached time: 20230811035345\nCache expiry: 86400\nDynamic content: false\nComplications: []\n[SMW] In‐text annotation parser time: 0.001 seconds\nCPU time usage: 0.008 seconds\nReal time usage: 0.039 seconds\nPreprocessor visited node count: 6/1000000\nPost‐expand include size: 0/2097152 bytes\nTemplate argument size: 0/2097152 bytes\nHighest expansion depth: 2/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    0.000      1 -total\n-->\n\n<!-- Saved in parser cache with key sebok_prod_new-bkcase_:pcache:idhash:981-0!canonical and timestamp 20230811035345 and revision id 67576\n-->\n</div></div><div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"https://sebokwiki.org/w/index.php?title=Maintainability_(glossary)&amp;oldid=67576\">https://sebokwiki.org/w/index.php?title=Maintainability_(glossary)&amp;oldid=67576</a>\"</div>\n    <div id=\"catlinks\" class=\"catlinks\" data-mw=\"interface\"><div id=\"mw-normal-catlinks\" class=\"mw-normal-catlinks\"><a href=\"/wiki/Special:Categories\" title=\"Special:Categories\">Category</a>: <ul><li><a href=\"/wiki/Category:Glossary_of_Terms\" title=\"Category:Glossary of Terms\">Glossary of Terms</a></li></ul></div></div><div class=\"cs-comments\" id=\"cs-comments\"><div class=\"cs-header\" id=\"cs-header\"><button type=\"button\" class=\"cs-add-button cs-button\" title=\"Add comment\" data-toggle=\"tooltip\" id=\"cs-add-button\"><img title=\"add comment\" src=\"/w/extensions/CommentStreams/images/comment_add.png\"><span class=\"cs-comment-button-label\">Add comment</span></button></div><div class=\"cs-footer\" id=\"cs-footer\"></div></div>\n</div>"
},
{ "title": "System Maintenance",
   "url": "https://sebokwiki.org/wiki/System_Maintenance",
   "body":"<div id=\"mw-content-text\" lang=\"en\" dir=\"ltr\" class=\"mw-content-ltr\"><div class=\"mw-parser-output\"><hr>\n    <p><i><b>Lead Authors:</b></i> <i>Scott Jackson, Brian Gallagher</i>, <i><b>Contributing Author:</b></i> <i>David Dorgan</i>\n    </p>\n    <hr>\n    <p><span class=\"noprint\"><a href=\"/wiki/Maintenance_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Maintenance (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p><i>&amp;lt;blockquote&amp;gt;The process of modifying a system or component after delivery to correct faults, improve performance or other attributes, or adapt to a changed environment.&amp;lt;/blockquote&amp;gt;</i>\n    </p>\">System Maintenance</span></a></span><span class=\"printonly\">System Maintenance</span> planning begins early in the acquisition process with development of a maintenance concept. Maintenance planning is conducted to evolve and establish requirements and tasks to be accomplished for achieving, restoring, and maintaining operational capability for the life of the system. For a <span class=\"noprint\"><a href=\"/wiki/System_(glossary)\" class=\"cat-glossary_of_terms\" title=\"System (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p>&amp;lt;blockquote&amp;gt;<i>(1) A set of elements in interaction.</i> (von Bertalanffy 1968)&amp;lt;/blockquote&amp;gt;\n    </p><p>&amp;lt;blockquote&amp;gt;<i>(2) combination of interacting elements organized to achieve one or more stated purposes (ISO/IEC/IEEE 2015)</i>&amp;lt;/blockquote&amp;gt;&amp;lt;blockquote&amp;gt;(3) A system is an arrangement of parts or elements that together exhibit behavior or meaning that the individual constituents do not. (INCOSE Fellows, 2019)&amp;lt;/blockquote&amp;gt;\n    </p>\">system</span></a></span><span class=\"printonly\">system</span> to be sustained throughout its <span class=\"noprint\"><a href=\"/wiki/Life_Cycle_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Life Cycle (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p>&amp;lt;blockquote&amp;gt;<i>(1) The organized collection of activities, relationships and contracts which apply to a system-of-interest during its life.</i> (Pyster 2009, 73)&amp;lt;/blockquote&amp;gt;\n    </p><p>&amp;lt;blockquote&amp;gt;<i>(2) The evolution of a system, product, service, project or other human-made entity from conception through retirement.</i> (ISO/IEC/IEEE 2015)&amp;lt;/blockquote&amp;gt;\n    </p><p>&amp;lt;blockquote&amp;gt;<i>(3) Development (life) cycles start with user needs and end with system decommissioning and disposal. Project cycles contain three aspects: business, budget, and technical.</i> (Mooz, Forsberg, Cotterman 2003, 259)&amp;lt;/blockquote&amp;gt;\n    </p>\">system life cycle</span></a></span><span class=\"printonly\">system life cycle</span>, the maintenance process has to be executed concurrently with the operations process (<a href=\"/wiki/ISO/IEC/IEEE_15288\" class=\"cat-primary_reference\" title=\"ISO/IEC/IEEE 15288\">ISO/IEC/IEEE 15288</a> 2015, Clause 6.4.9).\n    </p>\n    <div id=\"toc\" class=\"toc\" role=\"navigation\" aria-labelledby=\"mw-toc-heading\"><input type=\"checkbox\" role=\"button\" id=\"toctogglecheckbox\" class=\"toctogglecheckbox\" style=\"display:none\"><div class=\"toctitle\" lang=\"en\" dir=\"ltr\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n    <ul>\n    <li class=\"toclevel-1 tocsection-1\"><a href=\"#Overview\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Overview</span></a></li>\n    <li class=\"toclevel-1 tocsection-2\"><a href=\"#Process_Approaches\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Process Approaches</span></a></li>\n    <li class=\"toclevel-1 tocsection-3\"><a href=\"#Training_and_Certification\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Training and Certification</span></a></li>\n    <li class=\"toclevel-1 tocsection-4\"><a href=\"#Practical_Considerations\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Practical Considerations</span></a></li>\n    <li class=\"toclevel-1 tocsection-5\"><a href=\"#References\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">References</span></a>\n    <ul>\n    <li class=\"toclevel-2 tocsection-6\"><a href=\"#Works_Cited\"><span class=\"tocnumber\">5.1</span> <span class=\"toctext\">Works Cited</span></a></li>\n    <li class=\"toclevel-2 tocsection-7\"><a href=\"#Primary_References\"><span class=\"tocnumber\">5.2</span> <span class=\"toctext\">Primary References</span></a></li>\n    <li class=\"toclevel-2 tocsection-8\"><a href=\"#Additional_References\"><span class=\"tocnumber\">5.3</span> <span class=\"toctext\">Additional References</span></a></li>\n    </ul>\n    </li>\n    </ul>\n    </div>\n    \n    <h2><span class=\"mw-headline\" id=\"Overview\">Overview</span></h2>\n    <p>The initial requirements for maintenance have to be defined during the <a href=\"/wiki/Stakeholder_Needs_and_Requirements\" class=\"mw-redirect\" title=\"Stakeholder Needs and Requirements\">stakeholder needs and requirement definition process</a> (Clause 6.4.1) (<a href=\"/wiki/ISO/IEC/IEEE_15288\" class=\"cat-primary_reference\" title=\"ISO/IEC/IEEE 15288\">ISO/IEC/IEEE 15288</a> 2015) and continue to evolve during the development and operation of the system. Considerations include:\n    </p>\n    <ul><li>Maximizing system availability to meet the operational requirements. This has to take into account the designed-in <span class=\"noprint\"><a href=\"/wiki/Reliability_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Reliability (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p>&amp;lt;blockquote&amp;gt;<i>The probability of a system or system element performing its intended function under stated conditions without failure for a given period of time.</i> -- modified slightly from (American Society for Quality 2011)&amp;lt;/blockquote&amp;gt;\n    </p>\">reliability</span></a></span><span class=\"printonly\">reliability</span> and <span class=\"noprint\"><a href=\"/wiki/Maintainability_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Maintainability (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p>&amp;lt;blockquote&amp;gt;(1) <i>Maintainability is defined as the probability that a system or system element can be repaired in a defined environment with defined resources within a specified period of time. Increased maintainability implies shorter repair times.</i> (Created for SEBoK)&amp;lt;/blockquote&amp;gt;\n    </p><p>&amp;lt;blockquote&amp;gt;(2) <i>The American Society for Quality uses this definition.  &amp;quot;Maintainability: The probability that a given maintenance action for an item under given usage conditions can be performed within a stated time interval when the maintenance is performed under stated conditions using stated procedures and resources.&amp;quot;</i> (ASQ 2011) The definition above simplifies the ASQ definition.<i>&amp;lt;/blockquote&amp;gt;</i>\n    </p>\">maintainability</span></a></span><span class=\"printonly\">maintainability</span> of the system and resources available.</li>\n    <li>Preserving system operating potential through proper <a href=\"/wiki/Planning\" class=\"mw-redirect\" title=\"Planning\">planning</a> of system scheduled maintenance. This requires a reliability-centered maintenance strategy that incorporates preventive maintenance in order to preempt failures, thereby extending the mean time between corrective maintenance, as well as enhancing the availability of the system.</li>\n    <li>Segmenting maintenance activities for potential outsourcing of non-critical activities to approved maintenance subcontractors as to optimize scarce technical manpower resources and maintenance/repair turn-around times.</li>\n    <li>Harnessing IT technology for maintenance management. This involves rigorous and systematic capturing and tracking of operating and maintenance activities to facilitate analysis and planning.</li></ul>\n    <p>Maintenance management is concerned with the development and review of maintenance plans, as well as securing and coordinating resources, such as budget, service parts provisioning, and management of supporting tasks (e.g., contract administration, engineering support, and quality assurance). Maintenance planning relies on level of repair analysis (LORA) as a function of the system acquisition process. Initial planning addresses actions and support necessary to ensure a minimum <span class=\"noprint\"><a href=\"/wiki/Life_Cycle_Cost_(LCC)_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Life Cycle Cost (LCC) (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline tooltipstered\" data-simple-tooltip=\"<p>&amp;lt;blockquote&amp;gt;<i>The total cost of implementation and ownership of a system over its useful life. It includes the cost of development, acquisition, operation, maintenance, support, and, where applicable, disposal.</i> (Mooz, Forsberg, Cotterman 2003, 209)&amp;lt;/blockquote&amp;gt;\n    </p>\">life cycle cost</span></a></span><span class=\"printonly\">life cycle cost</span> (LCC).\n    </p>\n    <h2><span class=\"mw-headline\" id=\"Process_Approaches\">Process Approaches</span></h2>\n    <p>The purpose of the maintenance process is to sustain the capability of a system to provide a service. This process monitors the system’s capability to deliver services, records problems for analysis, takes corrective, adaptive, perfective, and preventive actions, and confirms restored capability. As a result of the successful implementation of the maintenance process:\n    </p>\n    <ul><li>a maintenance strategy is developed</li>\n    <li>maintenance constraints are provided as inputs to requirements</li>\n    <li>replacement system elements are made available</li>\n    <li>services meeting stakeholder requirements are sustained</li>\n    <li>the need for corrective design changes is reported</li>\n    <li>failure and lifetime data are recorded</li></ul>\n    <p>The project should implement the following activities and tasks in accordance with applicable organization policies and procedures with respect to the maintenance process:\n    </p>\n    <ul><li>scheduled servicing, such as daily inspection/checks, servicing, and cleaning</li>\n    <li>unscheduled servicing (carrying out fault detection and isolation to the faulty replaceable unit and replacement of the failed unit)</li>\n    <li>re-configuration of the system for different roles or functions</li>\n    <li>scheduled servicing (higher level scheduled servicing but below depot level)</li>\n    <li>unscheduled servicing (carrying out more complicated fault isolation to the faulty replaceable unit and replacement of the failed unit)</li>\n    <li>minor modifications</li>\n    <li>minor damage repairs</li>\n    <li>major scheduled servicing (e.g., overhaul and corrosion treatment)</li>\n    <li>major repairs (beyond normal removal and replacement tasks)</li></ul>\n    <p>The maintenance plan specifies the scheduled servicing tasks and intervals (preventive maintenance) and the unscheduled servicing tasks (adaptive or corrective maintenance). Tasks in the maintenance plan are allocated to the various maintenance agencies. A maintenance allocation chart is developed to tag the maintenance tasks to the appropriate maintenance agencies. These include: in-service or in-house work centers, approved contractors, affiliated maintenance or repair facilities, original equipment manufacturer (OEMs), etc. The maintenance plan also establishes the requirements for the support resources.  \n    </p><p>Related activities such as resource planning, budgeting, performance monitoring, upgrades, longer term supportability, and sustenance also need to be managed. These activities are planned, managed, and executed over a longer time horizon and they concern the well-being of the system over the entire life cycle.  \n    </p><p>Proper maintenance of the system (including maintenance-free system designs) relies very much on the availability of support resources, such as support and test equipment (STE), technical data and documentation, personnel, spares, and facilities.  These have to be factored in during the acquisition agreement process.\n    </p>\n    <h2><span class=\"mw-headline\" id=\"Training_and_Certification\">Training and Certification</span></h2>\n    <p>Adequate training must be provided for the technical personnel maintaining the system.  While initial training may have been provided during the deployment phase, additional personnel may need to be trained to cope with the increased number of systems being fielded, as well as to cater to staff turnover. Timely updates to training materials and trained personnel may be required as part of system upgrades and evolution.  It is important to define the certification standards and contract for the training materials as part of the supply agreement.\n    </p>\n    <h2><span class=\"mw-headline\" id=\"Practical_Considerations\">Practical Considerations</span></h2>\n    <p>The organization responsible for maintaining the system should have clear thresholds established to determine whether a change requested by end users, changes to correct latent defects, or changes required to fulfill the evolving mission are within the scope of a maintenance change or require a more formal project to step through the entire systems engineering life-cycle. Evaluation criteria to make such a decision could include cost, schedule, risk, or criticality characteristics.\n    </p>\n    <h2><span class=\"mw-headline\" id=\"References\">References</span></h2>\n    <h3><span class=\"mw-headline\" id=\"Works_Cited\">Works Cited</span></h3>\n    <p>ISO/IEC/IEEE. 2015.<i><a href=\"/wiki/ISO/IEC/IEEE_15288\" class=\"cat-primary_reference\" title=\"ISO/IEC/IEEE 15288\">Systems and Software Engineering - System Life Cycle Processes</a>.</i>Geneva, Switzerland: International Organization for Standardization (ISO)/International Electrotechnical Commission (IEC), Institute of Electrical and Electronics Engineers (IEEE). <a href=\"/wiki/ISO/IEC/IEEE_15288\" class=\"cat-primary_reference\" title=\"ISO/IEC/IEEE 15288\">ISO/IEC/IEEE 15288</a>:2015.\n    </p>\n    <h3><span class=\"mw-headline\" id=\"Primary_References\">Primary References</span></h3>\n    <p>Blanchard, B.S. and W.J. Fabrycky. 2011. <i><a href=\"/wiki/Systems_Engineering_and_Analysis\" class=\"cat-primary_reference\" title=\"Systems Engineering and Analysis\">Systems Engineering and Analysis</a>,</i> 5th Edition. Upper Saddle River, NJ, USA: Prentice Hall.\n    </p><p>DAU. 2010. <i><a href=\"/wiki/Defense_Acquisition_Guidebook_(DAG)\" class=\"cat-primary_reference\" title=\"Defense Acquisition Guidebook (DAG)\">Defense Acquisition Guidebook (DAG)</a></i>. Ft. Belvoir, VA, USA: Defense Acquisition University (DAU)/U.S. Department of Defense.\n    </p><p>INCOSE. 2012. <i><a href=\"/wiki/INCOSE_Systems_Engineering_Handbook\" class=\"cat-primary_reference\" title=\"INCOSE Systems Engineering Handbook\">INCOSE Systems Engineering Handbook</a>: A Guide for System Life Cycle Processes and Activities</i>. Version 3.2.2. San Diego, CA, USA: International Council on Systems Engineering (INCOSE), INCOSE-TP-2003-002-03.2.2.\n    </p><p>Institute of Engineers Singapore. 2009. <i><a href=\"/wiki/Systems_Engineering_Body_of_Knowledge_(Singapore)\" class=\"cat-primary_reference\" title=\"Systems Engineering Body of Knowledge (Singapore)\">Systems Engineering Body of Knowledge</a>,</i> Provisional version 2.0. Singapore: Institute of Engineers Singapore.\n    </p><p>IISO/IEC/IEEE. 2015.<i><a href=\"/wiki/ISO/IEC/IEEE_15288\" class=\"cat-primary_reference\" title=\"ISO/IEC/IEEE 15288\">Systems and Software Engineering - System Life Cycle Processes</a>.</i> Geneva, Switzerland: International Organization for Standardization (ISO)/International Electrotechnical Commission (IEC), Institute of Electrical and Electronics Engineers (IEEE).<a href=\"/wiki/ISO/IEC/IEEE_15288\" class=\"cat-primary_reference\" title=\"ISO/IEC/IEEE 15288\">ISO/IEC/IEEE 15288</a>:2015.\n    </p>\n    <h3><span class=\"mw-headline\" id=\"Additional_References\">Additional References</span></h3>\n    <p>None.\n    </p>\n    <hr>\n    <center><a href=\"/wiki/System_Operation\" class=\"cat-part_3 cat-system_deployment_and_use cat-topic\" title=\"System Operation\">&lt; Previous Article</a>  |  <a href=\"/wiki/Systems_Engineering_and_Management\" class=\"cat-part cat-part_3\" title=\"Systems Engineering and Management\">Parent Article</a>  |  <a href=\"/wiki/Logistics\" class=\"cat-part_3 cat-system_deployment_and_use cat-topic\" title=\"Logistics\">Next Article &gt;</a></center>\n    <center><b>SEBoK v. 2.8, released 31 May 2023</b></center>\n    <!-- \n    NewPP limit report\n    Cached time: 20230810171556\n    Cache expiry: 86400\n    Dynamic content: false\n    Complications: []\n    [SMW] In‐text annotation parser time: 0 seconds\n    CPU time usage: 0.044 seconds\n    Real time usage: 0.053 seconds\n    Preprocessor visited node count: 210/1000000\n    Post‐expand include size: 4451/2097152 bytes\n    Template argument size: 608/2097152 bytes\n    Highest expansion depth: 7/40\n    Expensive parser function count: 0/100\n    Unstrip recursion depth: 0/20\n    Unstrip post‐expand size: 3622/5000000 bytes\n    -->\n    <!--\n    Transclusion expansion time report (%,ms,calls,template)\n    100.00%   21.722      1 -total\n     98.07%   21.302      6 Template:Term\n    -->\n    \n    <!-- Saved in parser cache with key sebok_prod_new-bkcase_:pcache:idhash:129-0!canonical and timestamp 20230810171556 and revision id 67766\n     -->\n    </div></div>"

},
{
    "title":"Procurement and Acquisition",
    "url": "https://sebokwiki.org/wiki/Procurement_and_Acquisition",
    "body":"<h1 id=\"firstHeading\" class=\"firstHeading\" lang=\"en\">Procurement and Acquisition</h1>\n<div id=\"bodyContent\" class=\"mw-body-content\">\n    <div id=\"siteSub\" class=\"noprint\">From SEBoK</div>\n    <div id=\"contentSub\"><div id=\"breadcrumbs\"> <a href=\"/wiki/System_Operation\" class=\"cat-part_3 cat-system_deployment_and_use cat-topic\" title=\"System Operation\">System Operation</a> &gt; <a href=\"/wiki/Procurement_and_Acquisition\" class=\"cat-part_6 cat-systems_engineering_and_project_management cat-topic\" title=\"Procurement and Acquisition\">Procurement and Acquisition</a></div></div>\n    <div id=\"contentSub2\"></div>\n    \n    <div id=\"jump-to-nav\"></div>\n    <a class=\"mw-jump-link\" href=\"#mw-head\">Jump to navigation</a>\n    <a class=\"mw-jump-link\" href=\"#searchInput\">Jump to search</a>\n    <div id=\"mw-content-text\" lang=\"en\" dir=\"ltr\" class=\"mw-content-ltr\"><div class=\"mw-parser-output\"><hr />\n<p><i><b>Lead Author:</b></i> <i>Dick Fairley, </i><b>Contributing Author:</b><i> </i>Alice Squires<i></i>\n</p>\n<hr />\n<p><span class=\"noprint\"><a href=\"/wiki/Procurement_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Procurement (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline\" data-simple-tooltip=\"&lt;p&gt;&amp;lt;blockquote&amp;gt;&lt;i&gt;The overarching function that describes the activities and processes to acquire goods and services.&lt;/i&gt; (Purchasing Insight 2012)&amp;lt;/blockquote&amp;gt;\n&lt;/p&gt;\">Procurement</span></a></span><span class=\"printonly\">Procurement</span> is the act of buying goods and services. <span class=\"noprint\"><a href=\"/wiki/Acquisition_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Acquisition (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline\" data-simple-tooltip=\"&lt;p&gt;&amp;lt;blockquote&amp;gt;&lt;i&gt;The process of obtaining a system, product or service.&lt;/i&gt; (ISO/IEC/IEEE 2015)&amp;lt;/blockquote&amp;gt;\n&lt;/p&gt;\">Acquisition</span></a></span><span class=\"printonly\">Acquisition</span> covers the conceptualization, initiation, design, development, testing, contracting, production, deployment, logistics support, modification, and disposal of weapons and other systems, as well as supplies or services (including construction) to satisfy organizational needs intended for use in, or in support of, defined missions (DAU 2010; DoD 2001). \n</p><p>Acquisition covers a much broader range of topics than procurement. Acquisition spans the whole life cycle of acquired systems. The procurement of appropriate systems engineering (SE) acquisition activities and levels of SE support is critical for an organization to meet the challenge of developing and maintaining complex systems. \n</p><p>The <i>Guide for Integrating Systems Engineering into DoD Acquisition Contracts</i> addresses how systems engineering activities are integrated into the various elements of acquisition and procurement (DoD 2006a). \n</p>\n<div id=\"toc\" class=\"toc\" role=\"navigation\" aria-labelledby=\"mw-toc-heading\"><input type=\"checkbox\" role=\"button\" id=\"toctogglecheckbox\" class=\"toctogglecheckbox\" style=\"display:none\" /><div class=\"toctitle\" lang=\"en\" dir=\"ltr\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Acquisition_Process_Model\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Acquisition Process Model</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#Systems_Engineering_Role_in_the_Acquisition_Process\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Systems Engineering Role in the Acquisition Process</span></a></li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#Importance_of_the_Acquisition_Strategy_in_the_Procurement_Process\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Importance of the Acquisition Strategy in the Procurement Process</span></a></li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#Relating_Acquisition_to_Request_for_Proposal_and_Technical_Attributes\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Relating Acquisition to Request for Proposal and Technical Attributes</span></a></li>\n<li class=\"toclevel-1 tocsection-5\"><a href=\"#Contract-Related_Activities_and_the_Offeror.E2.80.99s_Systems_Engineering_and_Project_Management_Roles\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Contract-Related Activities and the Offeror’s Systems Engineering and Project Management Roles</span></a></li>\n<li class=\"toclevel-1 tocsection-6\"><a href=\"#Offeror_and_Supplier_Interactions\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Offeror and Supplier Interactions</span></a></li>\n<li class=\"toclevel-1 tocsection-7\"><a href=\"#Contracts_and_Subcontracts\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">Contracts and Subcontracts</span></a></li>\n<li class=\"toclevel-1 tocsection-8\"><a href=\"#References\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">References</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-9\"><a href=\"#Works_Cited\"><span class=\"tocnumber\">8.1</span> <span class=\"toctext\">Works Cited</span></a></li>\n<li class=\"toclevel-2 tocsection-10\"><a href=\"#Primary_References\"><span class=\"tocnumber\">8.2</span> <span class=\"toctext\">Primary References</span></a></li>\n<li class=\"toclevel-2 tocsection-11\"><a href=\"#Additional_References\"><span class=\"tocnumber\">8.3</span> <span class=\"toctext\">Additional References</span></a></li>\n</ul>\n</li>\n</ul>\n</div>\n\n<h2><span class=\"mw-headline\" id=\"Acquisition_Process_Model\">Acquisition Process Model</span></h2>\n<p>Multiple acquisition process models exist. An acquisition process for major systems in industry and defense is shown in Figure 1. The process of acquisition is defined by a series of phases during which technology is defined and matured into viable concepts. These concepts are subsequently developed and readied for production, after which the systems produced are supported in the field. \n</p><p>Acquisition planning is the process of identifying and describing needs, capabilities, and requirements, as well as determining the best method for meeting those requirements (e.g., program acquisition strategy). This process includes procurement; thus, procurement is directly linked to the acquisition process model. The process model present in Figure 1 allows a given acquisition to enter the process at any of the development phases. \n</p><p>For example, a system using unproven technology would enter at the beginning stages of the process and would proceed through a lengthy period of technology maturation. On the other hand, a system based on mature and proven technologies might enter directly into engineering development or sometimes even production. \n</p>\n<div class=\"center\"><div class=\"thumb tnone\"><div class=\"thumbinner\" style=\"width:452px;\"><a href=\"/wiki/File:ACQProcessModel_NoWhiteS.png\" class=\"image\"><img alt=\"\" src=\"/w/images/sebokwiki-farm!w/thumb/a/ae/ACQProcessModel_NoWhiteS.png/450px-ACQProcessModel_NoWhiteS.png\" decoding=\"async\" width=\"450\" height=\"251\" class=\"thumbimage\" srcset=\"/w/images/sebokwiki-farm!w/thumb/a/ae/ACQProcessModel_NoWhiteS.png/675px-ACQProcessModel_NoWhiteS.png 1.5x, /w/images/sebokwiki-farm!w/a/ae/ACQProcessModel_NoWhiteS.png 2x\" data-file-width=\"722\" data-file-height=\"402\" /></a>  <div class=\"thumbcaption\"><div class=\"magnify\"><a href=\"/wiki/File:ACQProcessModel_NoWhiteS.png\" class=\"internal\" title=\"Enlarge\"></a></div><b>Figure 1. An Acquisition Process Model (DAU 2010).</b> Released by Defense Acquisition University (DAU)/U.S. Department of Defense (DoD).</div></div></div></div>\n<h2><span class=\"mw-headline\" id=\"Systems_Engineering_Role_in_the_Acquisition_Process\">Systems Engineering Role in the Acquisition Process</span></h2>\n<p>The procurement of complex systems usually requires a close relationship between the offeror and supplier SE teams due to the breadth and depth of SE activities. SE is an overarching process that the program team applies in order to transition from a stated capability need to an affordable, operationally effective, and suitable system. \n</p><p>SE is important to every phase of the acquisition process. SE encompasses the application of SE processes across the acquisition life cycle and is intended to be an integrating mechanism for balanced solutions addressing capability needs, design considerations, and constraints. It is also intended to address limitations imposed by technology, budget, and schedule. \n</p><p>SE is an interdisciplinary approach; that is, it is a structured, disciplined, and documented technical effort to simultaneously design and develop system products and processes to satisfy the needs of the customer. Regardless of the scope and type of program, or at what point it enters the program acquisition life cycle, the technical approach to the program needs to be integrated with the <span class=\"noprint\"><a href=\"/wiki/Acquisition_Strategy_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Acquisition Strategy (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline\" data-simple-tooltip=\"&lt;p&gt;&lt;i&gt;&amp;lt;blockquote&amp;gt;A comprehensive, integrated plan that identifies the acquisition approach and describes the business, technical, and support strategies that management will follow to manage program risks and meet program objectives. The acquisition strategy should define the relationship between the acquisition phases and work efforts, and key program events such as decision points, reviews, contract awards, test activities, production lot/delivery quantities, and operational deployment objectives.&lt;/i&gt; (DAU 2010)&amp;lt;/blockquote&amp;gt;\n&lt;/p&gt;\">acquisition strategy</span></a></span><span class=\"printonly\">acquisition strategy</span> to obtain the best program solution.\n</p><p>Acquisition and procurement in the commercial sector have many characteristics in common with their counterparts in the realm of government contracting, although the processes in the commercial world are usually accomplished with fewer rigors than occur between government and contractor interactions.  Offshore outsourcing is commonly practiced in the commercial software arena with the goal of reducing the cost of labor. Commercial organizations sometimes subcontract with other commercial organizations to provide missing expertise and to balance the ebb and flow of staffing needs.  \n</p><p>In some cases, relations between the contracting organization and the subcontractor are strained because of the contracting organization’s desire to protect its intellectual property and development practices from potential exposure to the subcontractor.  Commercial organizations often have lists of approved vendors that are used to expedite the procurement of needed equipment, products, and services.  In these situations, commercial organizations have processes to evaluate and approve vendors in ways that are analogous to the qualification of government contractors. Many commercial organizations apply SE principles and procedures even though they may not identify the personnel and job functions as “systems engineers” or “systems engineering.”\n</p>\n<h2><span class=\"mw-headline\" id=\"Importance_of_the_Acquisition_Strategy_in_the_Procurement_Process\">Importance of the Acquisition Strategy in the Procurement Process</span></h2>\n<p>The <span class=\"noprint\"><a href=\"/wiki/Acquisition_Strategy_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Acquisition Strategy (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline\" data-simple-tooltip=\"&lt;p&gt;&lt;a href='/wiki/Acquisition_Strategy_(glossary)' class='cat-glossary_of_terms' title='Acquisition Strategy (glossary)'&gt;acquisition strategy &lt;/a&gt;\n&lt;/p&gt;\">acquisition strategy</span></a></span><span class=\"printonly\">acquisition strategy</span> is usually developed during the front end of the acquisition life cycle. (For an example of this, see the Technology Development Phase in Figure 1.) The acquisition strategy provides the integrated strategy for all aspects of the acquisition program throughout the program life cycle. \n</p><p>In essence, the acquisition strategy is a high-level business and technical management approach designed to achieve program objectives within specified resource constraints. It acts as the framework for planning, organizing, staffing, controlling, and leading a program, as well as for establishing the appropriate contract mechanisms. It provides a master schedule for research, development, testing, production, fielding, and other SE related activities essential for program success, as well as for formulating functional strategies and plans. \n</p><p>The offeror’s program team, including systems engineering, is responsible for developing and documenting the acquisition strategy, which conveys the program objectives, direction, and means of control based on the integration of strategic, technical, and resource concerns. A primary goal of the acquisition strategy is the development of a plan that will minimize the time and cost of satisfying an identified, validated need while remaining consistent with common sense and sound business practices.  While the contract officer (CO) is responsible for all contracting aspects, including determining which type of contract is most appropriate, and following the requirements of existing regulations, directives, instructions, and policy memos of an organization, the program manager (PM) works with the CO to develop the best contract/procurement strategy and contract types.\n</p>\n<h2><span class=\"mw-headline\" id=\"Relating_Acquisition_to_Request_for_Proposal_and_Technical_Attributes\">Relating Acquisition to Request for Proposal and Technical Attributes</span></h2>\n<p>There are several formats for requesting proposals from offerors for building complex systems.  Figure 2 relates acquisition program elements to a representative request for proposal (RFP) topical outline and key program technical attributes that have been used by the Department of Defense. In general, programs have a better chance of success when both the offeror and supplier understand the technical nature of the program and the need for the associated SE activities. \n</p><p>The offeror and supplier need to clearly communicate the technical aspect of the program throughout the procurement process. The offeror’s RFP and the associated supplier proposal represent one of the formal communications paths. A partial list of key program technical attributes is presented in Figure 2. \n</p>\n<div class=\"center\"><div class=\"thumb tnone\"><div class=\"thumbinner\" style=\"width:652px;\"><a href=\"/wiki/File:RelatingACQtoRFP_NoWhiteS.png\" class=\"image\"><img alt=\"\" src=\"/w/images/sebokwiki-farm!w/thumb/1/12/RelatingACQtoRFP_NoWhiteS.png/650px-RelatingACQtoRFP_NoWhiteS.png\" decoding=\"async\" width=\"650\" height=\"489\" class=\"thumbimage\" srcset=\"/w/images/sebokwiki-farm!w/1/12/RelatingACQtoRFP_NoWhiteS.png 1.5x\" data-file-width=\"721\" data-file-height=\"542\" /></a>  <div class=\"thumbcaption\"><div class=\"magnify\"><a href=\"/wiki/File:RelatingACQtoRFP_NoWhiteS.png\" class=\"internal\" title=\"Enlarge\"></a></div><b>Figure 2. Relating Acquisition to Request for Proposal and Technical Attributes. (DoD 2006a).</b> Released by the U.S. Office of the Secretary of Defense.</div></div></div></div>\n<h2><span id=\"Contract-Related_Activities_and_the_Offeror’s_Systems_Engineering_and_Project_Management_Roles\"></span><span class=\"mw-headline\" id=\"Contract-Related_Activities_and_the_Offeror.E2.80.99s_Systems_Engineering_and_Project_Management_Roles\">Contract-Related Activities and the Offeror’s Systems Engineering and Project Management Roles</span></h2>\n<p>A clear understanding of the technical requirements is enhanced via the development of a <span class=\"noprint\"><a href=\"/wiki/Systems_Engineering_Plan_(SEP)_(glossary)\" class=\"cat-glossary_of_terms\" title=\"Systems Engineering Plan (SEP) (glossary)\"><span class=\"simple-tooltip simple-tooltip-inline\" data-simple-tooltip=\"&lt;p&gt;&lt;i&gt;&amp;lt;blockquote&amp;gt;A systems engineering plan (SEP) is a &amp;quot;living&amp;quot; document that captures a program's current and evolving systems engineering strategy and its relationship with the overall program management effort. The SEP purpose is to guide all technical aspects of the program. It should be established early in the Materiel Solution Analysis phase and updated continually.&lt;/i&gt; (DAU 2012)&amp;lt;/blockquote&amp;gt;\n&lt;/p&gt;\">Systems Engineering Plan</span></a></span><span class=\"printonly\">Systems Engineering Plan</span> (SEP). The SEP documents the systems engineering strategy for a project or program and acts as the blueprint for the conduct, management, and control of the technical aspects of the acquisition program (DoD 2011).  The SEP documents the SE structure and addresses government and contractor boundaries. It summarizes the program’s selected acquisition strategy and identifies and links to program risks. It also describes how the contractor's, and sometimes the subcontractor's and suppliers', technical efforts are to be managed.\n</p><p>Once the technical requirements are understood, a contract may be developed and followed by the solicitation of suppliers. The offeror's PM, chief or lead systems engineer, and CO must work together to translate the program’s acquisition strategy and associated technical approach (usually defined in a SEP) into a cohesive, executable contract(s). \n</p><p>Table 1 shows some key contracting-related tasks with indicators of the roles of the PM and LSE.\n</p>\n<table>\n<caption><b>Table 1. Offeror’s Systems Engineering and Program Management Roles (DoD 2006).</b> Released by the U.S. Office of the Secretary of Defense. <b></b>\n</caption>\n<tbody><tr>\n<th>Typical Contract-Related Activities\n</th>\n<th>Systems Engineer and Project Manager Roles\n</th></tr>\n<tr>\n<td>1. Identify overall procurement requirements and associated budget. Describe the offer’s needs and any constraints on the procurement.\n</td>\n<td>1. Lead systems engineer (LSE) provides program technical requirements. PM provides any programmatic related requirements.\n</td></tr>\n<tr>\n<td>2. Identify technical actions required to successfully complete technical and procurement milestones. The program’s SEP is the key source for capturing this technical planning.\n</td>\n<td>2. LSE defines the technical strategy/approach and required technical efforts. This should be consistent with the program’s Acquisition Strategy.\n</td></tr>\n<tr>\n<td>3. Document market research results and identify potential industry sources.\n</td>\n<td>3. PM and LSE identify programmatic and technical information needed and assist in evaluating the results.\n</td></tr>\n<tr>\n<td>4. Prepare a Purchase Request, including product descriptions; priorities, allocations and allotments; architecture; government-furnished property or equipment (or Government-Off-The-Shelf (GOTS); government-furnished information; information assurance and security considerations; and required delivery schedules.\n</td>\n<td>4. PM and LSE ensure the specific programmatic and technical needs are defined clearly (e.g., commercial-off-the-shelf (COTS) products).\n</td></tr>\n<tr>\n<td>5. Identify acquisition streamlining approach and requirements, budgeting and funding, management information requirements, environmental considerations, offeror’s expected skill sets, and milestones. These should be addressed in the Acquisition Strategy.\n</td>\n<td>5. The procurement team work together, but the CO has the prime responsibility.\n<p>The PM is the owner of the program Acquisition Strategy.  The LSE develops and reviews (and the PM approves) the technical strategy.\n</p>\n</td></tr>\n<tr>\n<td>6. Plan the requirements for the contract Statement of Objectives (SOO) / Statement of Work (SOW) / specification, project technical reviews, acceptance requirements, and schedule.\n</td>\n<td>6. LSE is responsible for the development of the technical aspects of the SOO/SOW.\n</td></tr>\n<tr>\n<td>7. Plan and conduct Industry Days as appropriate.\n</td>\n<td>7. PM and LSE support the CO in planning the meeting agenda to ensure technical needs are discussed.\n</td></tr>\n<tr>\n<td>8. Establish contract cost, schedule, and performance reporting requirements. Determine an incentive strategy and appropriate mechanism (e.g., Award Fee Plan and criteria).\n</td>\n<td>8. LSE provides technical resource estimates.\n<p>LSE supports development of the Work\nBreakdown Structure (WBS) \nbased on preliminary system\nspecifications, determines event-driven\ncriteria for key technical reviews, and determines what technical artifacts are baselined. The PM and LSE advise the CO in developing the metrics/criteria for an incentive mechanism.\n</p>\n</td></tr>\n<tr>\n<td>9. Identify data requirements.\n</td>\n<td>9. LSE identifies all technical Contractor Data Requirements List (CDRL) and technical performance expectations.\n</td></tr>\n<tr>\n<td>10. Establish warranty requirements, if applicable.\n</td>\n<td>10. LSE works with the CO to determine cost-effective warranty requirements.\n</td></tr>\n<tr>\n<td>11. Prepare a Source Selection Plan (SSP) and RFP (for competitive contracts).\n</td>\n<td>11. PM and LSE provide input to the SSP per the SOO/SOW.\n</td></tr>\n<tr>\n<td>12. Conduct source selection and award the contract to the successful offeror.\n</td>\n<td>12. PM and LSE participate on evaluation teams.\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Offeror_and_Supplier_Interactions\">Offeror and Supplier Interactions</span></h2>\n<p>There should be an environment of open communication prior to the formal source selection process. This ensures that the supplier understands the offeror’s requirements and that the offeror understands the supplier's capabilities and limitations, as well as enhancing the supplier's involvement in the development of a program acquisition strategy. During the pre-solicitation phase, the offeror develops the solicitation and may ask suppliers to provide important insights into the technical challenges, program technical approach, and key business motivations. \n</p><p>For example, potential bidders could be asked for their assessment of a proposed system's performance based on the maturity level of new and existing technologies.\n</p>\n<h2><span class=\"mw-headline\" id=\"Contracts_and_Subcontracts\">Contracts and Subcontracts</span></h2>\n<p>Typical types of contracts include the following:\n</p>\n<ul><li><b>Fixed Price</b>: In a fixed price contract the offeror proposes a single price for all products and services to implement the project. This single price is sometimes referred to as low bid or lump sum. A fixed price contract transfers the project risks to the supplier. When there is a cost overrun, the supplier absorbs it. If the supplier performs better than planned, their profit is higher.  Since all risks are absorbed by the supplier, a fixed price bid may be higher to reflect this.</li></ul>\n<ul><li><b>Cost-reimbursement</b> [Cost plus]: In a cost-reimbursement contract the offeror provides a fixed fee, but also reimburses the contractor for labor, material, overhead, and administration costs. Cost-reimbursement type contracts are used when there is a high level of project risk and uncertainty. With this type of contract, the risks reside primarily with the offeror. The supplier gets reimbursed for all of its costs. Additional costs that arise due to changes or rework are covered by the offeror. This type of contract is often recommended for the system definition of hardware and software development when there is a risk of stakeholder changes to the system.</li></ul>\n<ul><li><b>Subcontracts</b>: A subcontractor performs work for another company as part of a larger project. A subcontractor is hired by a general contractor (also known as a prime or main contractor) to perform a specific set of tasks as part of the overall project. The incentive to hire subcontractors is either to reduce costs or to mitigate project risks. The systems engineering team is involved in establishing the technical contract requirements, technical selection criteria, acceptance requirements, and the technical monitoring and control processes.</li></ul>\n<ul><li><b>Outsource contracts</b>: Outsourced contracts are used to obtain goods or services by contracting with an outside supplier. Outsourcing usually involves contracting a business function, such as software design and code development, to an external provider.</li></ul>\n<ul><li><b>Exclusively Commercial Off-the-Shelf (COTS)</b>: Exclusively COTS contracts are completely satisfied with commercial solutions that require no modification for use. COTS solutions are used in the environment without modifying the COTS system. They are integrated into an existing user's platform or integrated into an existing operational environment. The systems engineering team is involved in establishing the technical contract requirements, technical acceptance, and technical selection criteria.</li></ul>\n<ul><li><b>Integrated COTS</b>: Integrated COTS contracts use commercially available products and integrate them into existing user platforms or operational environments. In some cases, integrated COTS solutions modify the system's solution. The cost of integrating the commercial COTS product into the operational environment can exceed the cost of the COTS product itself. As a result, the systems engineering team is usually involved in establishing the technical outsourcing contract requirements, technical selection criteria, technical monitoring and control processes, and technical acceptance and integration processes.</li></ul>\n<ul><li><b>COTS Modification</b>: COTS modification requires the most time and cost because of the additional work needed to modify the COTS product and integrate it into the system. Depending on how complex and critical the need is, the systems engineering team is usually involved in establishing the technical outsource contract requirements, technical selection criteria, technical monitoring and control processes, and technical acceptance requirements.</li></ul>\n<ul><li><b>IT services</b>: IT services provide capabilities that can enable an enterprise, application, or Web service solution. IT services can be provided by an outsourced service provider. In many cases, the user interface for these Web services is as simple as a Web browser. Depending on how complex and critical the needs are, the systems engineering team can be involved in establishing the technical outsourcing contract requirements, technical selection criteria, and technical acceptance process.</li></ul>\n<h2><span class=\"mw-headline\" id=\"References\">References</span></h2>\n<h3><span class=\"mw-headline\" id=\"Works_Cited\">Works Cited</span></h3>\n<p>DAU. 2010. <i><a href=\"/wiki/Defense_Acquisition_Guidebook_(DAG)\" class=\"cat-primary_reference\" title=\"Defense Acquisition Guidebook (DAG)\">Defense Acquisition Guidebook (DAG)</a>.</i> Ft. Belvoir, VA, USA: Defense Acquisition University (DAU)/US Department of Defense (DoD).\n</p><p>DoD. 2011. <i><a href=\"/wiki/Systems_Engineering_Plan_Outline\" class=\"cat-primary_reference\" title=\"Systems Engineering Plan Outline\">Systems Engineering Plan (SEP) Outline</a>.</i> Washington, DC, USA: Office of the Undersecretary of Defense for Acquisition, Transportation, and Logistics (AT&amp;L), US Department of Defense (DoD).\n</p><p>DoD. 2006.  <i><a href=\"/wiki/Guide_for_Integrating_Systems_Engineering_into_DoD_Acquisition_Contracts\" class=\"cat-primary_reference\" title=\"Guide for Integrating Systems Engineering into DoD Acquisition Contracts\">Guide for Integrating Systems Engineering into DoD Acquisition Contracts</a>.</i>  Washington, DC, USA: Office of the Undersecretary of Defense for Acquisition, Transportation, and Logistics (AT&amp;L), US Department of Defense (DoD).\n</p><p>DoD. 2001. <i>Systems Engineering Fundamentals.</i> Washington, DC, USA: Defense Acquisition University Press/US Department of Defense.\n</p>\n<h3><span class=\"mw-headline\" id=\"Primary_References\">Primary References</span></h3>\n<p>DAU. 2010. <i><a href=\"/wiki/Defense_Acquisition_Guidebook_(DAG)\" class=\"cat-primary_reference\" title=\"Defense Acquisition Guidebook (DAG)\">Defense Acquisition Guidebook (DAG)</a>.</i> Ft. Belvoir, VA, USA: Defense Acquisition University (DAU)/US Department of Defense (DoD).\n</p><p>DoD. 2011. <i><a href=\"/wiki/Systems_Engineering_Plan_Outline\" class=\"cat-primary_reference\" title=\"Systems Engineering Plan Outline\">Systems Engineering Plan (SEP) Outline</a>.</i> Washington, DC, USA: Office of the Undersecretary of Defense for Acquisition, Transportation, and Logistics (AT&amp;L), US Department of Defense (DoD).\n</p><p>DoD. 2006.  <i><a href=\"/wiki/Guide_for_Integrating_Systems_Engineering_into_DoD_Acquisition_Contracts\" class=\"cat-primary_reference\" title=\"Guide for Integrating Systems Engineering into DoD Acquisition Contracts\">Guide for Integrating Systems Engineering into DoD Acquisition Contracts</a>.</i>  Washington, DC, USA: Office of the Undersecretary of Defense for Acquisition, Transportation, and Logistics (AT&amp;L), US Department of Defense (DoD).\n</p>\n<h3><span class=\"mw-headline\" id=\"Additional_References\">Additional References</span></h3>\n<p>MITRE.  2011.  \"Acquisition Systems Engineering.\"  <i>Systems Engineering Guide. </i> Accessed March 9, 2012. Available: <a rel=\"nofollow\" class=\"external free\" href=\"http://www.mitre.org/work/systems_engineering/guide/acquisition_systems_engineering/\">http://www.mitre.org/work/systems_engineering/guide/acquisition_systems_engineering/</a>.\n</p>\n<hr />\n<center><a href=\"/wiki/The_Influence_of_Project_Structure_and_Governance_on_Systems_Engineering_and_Project_Management_Relationships\" class=\"cat-part_6 cat-systems_engineering_and_project_management cat-topic\" title=\"The Influence of Project Structure and Governance on Systems Engineering and Project Management Relationships\">&lt; Previous Article</a> | <a href=\"/wiki/Systems_Engineering_and_Project_Management\" class=\"cat-knowledge_area cat-part_6\" title=\"Systems Engineering and Project Management\">Parent Article</a> | <a href=\"/wiki/Portfolio_Management\" class=\"cat-part_6 cat-systems_engineering_and_project_management cat-topic\" title=\"Portfolio Management\">Next Article &gt;</a></center>\n<center><b>SEBoK v. 2.8, released 31 May 2023</b></center>"
}
]